app/views/bands/show.html.erb

<ul>
<% @band.concerts.each do |concert| %>
---
SELECT "concerts".* FROM "concerts" INNER JOIN "performances" ON "concerts"."id" = "performances"."concert_id" WHERE "performances"."band_id" = ?  [["band_id", 5]]