app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bruce@jr.com"], ["LIMIT", 1]]
---
    def verification
        # byebug
        user = User.find_by(email: params[:email])