app/controllers/concerts_controller.rb

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        @concert = Concert.find(params[:id])