app/controllers/users_controller.rb

    def show
        @user = User.find(params[:id])
        @shows = UserConcert.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "user_concerts".* FROM "user_concerts" WHERE "user_concerts"."user_id" = ?  [["user_id", 8]]

    def create
        @user = User.create(params.require(:user).permit(:name, :email))
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Evans"], ["email", "evans@evans.com"], ["created_at", "2019-08-15 21:23:55.155754"], ["updated_at", "2019-08-15 21:23:55.155754"]]

    def update
        @user = User.find(params[:id])
        @user.update(params.require(:user).permit(:name, :email))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "bruce@jr.edu"], ["updated_at", "2019-08-16 14:51:24.292663"], ["id", 7]]