app/models/concert.rb

    def headliners
        num_bands = self.num_headliners
        case num_bands
        when 1
            self.bands.first.name.titleize
---
SELECT "bands".* FROM "bands" INNER JOIN "performances" ON "bands"."id" = "performances"."band_id" WHERE "performances"."concert_id" = ?  [["concert_id", 6]]